import Seed from '../assets/seed.svg'
import Seed1 from '../assets/seed1.svg'
import Seed2 from '../assets/seed2.svg'
import Seed3 from '../assets/seed3.svg'
import Seed4 from '../assets/seed4.svg'
import prod1 from '../assets/prod1.svg'
import prod2 from '../assets/prod2.svg'
import prod3 from '../assets/prod3.svg'
import prod5 from '../assets/prod5.svg'

export const navitems = [
    {
        item: 'Каталог продукції',
        id: 1
    },
    {
        item: 'Оплата і доставка',
        id: 2
    },
    {
        item: 'Партнери',
        id: 3
    },
    {
        item: 'Новини',
        id: 4
    },
    {
        item: 'Контакти',
        id: 5
    }
]

export const badgedata = [
    {
        Icon: Seed,
        text: 'Насіння'
    },
    {
        Icon: Seed1,
        text: 'Засоби захисту рослин'
    },
    {
        Icon: Seed2,
        text: 'Добрива'
    },
    {
        Icon: Seed3,
        text: 'кормова група'
    },
    {
        Icon: Seed4,
        text: 'Агроному в поміч'
    },
]

export const products = [
    {
        id: 1,
        productName: 'Скор 250 ЕС к.э.',
        detail: 'В наявності',
        price: 589,
        image: prod1
    },
    {
        id: 2,
        productName: 'Скор 250 ЕС к.э.',
        detail: 'В наявності',
        price: 200,
        image: prod2
    },
    {
        id: 3,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 200,
        image: prod2
    },
    {
        id: 4,
        productName: 'Скор 250 ЕС к.э.',
        detail: 'В наявності',
        price: 589,
        image: prod1
    },
    {
        id: 5,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 200,
        image: prod5
    },
    {
        id: 6,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 200,
        image: prod3
    },
    {
        id: 7,
        productName: 'Скор 250 ЕС к.э.',
        detail: 'В наявності',
        price: 589,
        image: prod1
    },
    {
        id: 8,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 20,
        image: prod5
    },
    {
        id: 9,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 20,
        image: prod2
    },
    {
        id: 10,
        productName: 'Скор 250 ЕС к.э.',
        detail: 'В наявності',
        price: 589,
        image: prod1
    },
    {
        id: 11,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 20,
        image: prod5
    },
    {
        id: 12,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 20,
        image: prod3
    },
    {
        id: 13,
        productName: 'Скор 250 ЕС к.э.',
        detail: 'В наявності',
        price: 589,
        image: prod1
    },
    {
        id: 14,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 20,
        image: prod5
    },
    {
        id: 15,
        productName: 'Петунія Софістика F1',
        detail: 'В наявності',
        price: 20,
        image: prod3
    }
]

export const side1 = [
    {
        cat: 'Гербіциди',
        qty: 229
    },
    {
        cat: 'Фунгіциди',
        qty: 29
    },
    {
        cat: 'Інсектициди',
        qty: 9
    },
    {
        cat: 'Десиканти',
        qty: 209
    },
    {
        cat: 'Протруювачі',
        qty: 120
    },
    {
        cat: 'Ад’юванти ',
        qty: 215
    },
    {
        cat: 'Родентициди',
        qty: 410
    },
    {
        cat: 'Ретарданти',
        qty: 30
    },
]

export const side2 = [
    'Нертус',
    'Басф',
    'Адама Україна',
    'Байєр',
    'ГЗД',
    'Штефес',
    'Соняшник',
    'Кукурудза',
    'Пшениця',
    'Ячмінь',
    'Ріпак' ,
    'Соя',
    'Горох', 
    'Боби',
    'Гірчиця',
    'Горошок', 
    'Житняк', 
    'Квасоля',
    'Конюшина',
    'Кострець/Костриця',
    'Люцерна', 
    'Тимофіївка', 
    'Тритикале', 
    'Цукровий буряк',
    'Кормовий буряк',
    'Інше',
    '1',
    '2',
    '3',
    '4',
    '5',
    '6'
]

export const pagenumbers = [
    '1',
    '2',
    '...',
    '6',
    '7'
]

export const footerLinks = [
    'Про компанію',
    'Оплата і доставка',
    'Партнери',
    'Каталог продукції',
    'Засоби захисту рослин',
    'Насіння',
    'Добрива',
    'Агроному в поміч'
]

export const tabListItem = [
    'Проникаючи в рослину, припиняє процес утворення хлорофілу і каротину, тим самим зупиняє процес фотосинтезу;',
    'Знищує бур’яни та створює умови озимому ріпаку для доброго росту і розвитку в осінній період, усуваючи конкуренцію рослин за світло, вологу та поживні речовини на самих ранніх етапах органогенезу;',
    'Добре зв´язується у грунті та слабо промивається;',
    'Для комплексного захисту ріпаку зазвичай;',
    'Використовується у бакових сумішах із д.р. метазахлор та пропізохлор;',
    'В країнах Східної Європи (Чехія, Словаччина, Польща) використання Комманд® на посівах ріпаку є обов’язковим елементом в технології його вирощування;',
    'Широко використовується більше, ніж в 100 країнах світу на посівах ріпаку, сої, тютюну, перцю, моркви, картоплі, баштанних, бавовни та інших культур.',
    'Для досягнення максимального ефекту потрібен якісний обробіток ґрунту: відсутність грудок, вирівняна поверхня поля, відсутність рослинних решток;',
    'Обприскування ґрунту проводиться впродовж двох днів, а найкраще відразу ж після посіву;',
    'За недостачі ґрунтової вологи після обприскування рекомендується провести коткування ґрунту кільчасто- шпоровими котками;',
    'Норма витрати залежить від вмісту гумусу в ґрунті, на малогумусних ґрунтах її можна дещо знизити;',
    'Може виникнути побіління першої пари листочків ріпаку, проте в подальшому воно зникає, а рослини мають більш розвинену кореневу систему, краще витримують низькі температури;',
    'За потреби пересіву через 30-60 днів після обробки ріпак та сою можна сіяти після поверхневого обробітку ґрунту на глибину 8-10 см, для всіх інших культур рекомендується провести глибоку оранку;',
    'Обов´язковою вимогою під час внесення препарату є забезпечення суцільного покриття поверхні поля.'
]
